runs/case_20/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
429558
(
(6.60125 0.000150178 0.000775717)
(6.60147 -0.000883969 -0.00055967)
(6.59925 -0.000658577 -0.000530226)
(6.59928 -0.000314585 -0.000252937)
(6.59959 -0.000438537 -0.000364097)
(6.59815 -0.000622067 -0.000551385)
(6.59926 2.20166e-06 0.000328699)
(6.59883 -0.000599777 -0.000412647)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (6.6 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    sides
    {
        type            slip;
    }
    symmetry
    {
        type            symmetryPlane;
    }
    tailfin
    {
        type            noSlip;
    }
}


// ************************************************************************* //
